app/views/constituencies/index.html.erb

SELECT "constituencies".* FROM "constituencies"
---
  <tbody>
    <% @constituencies = Constituency.all %>