app/controllers/committees_controller.rb

SELECT "committees".* FROM "committees"
---
  def index
    @committees = Committee.all

INSERT INTO "committees" ("name", "logo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Com1"], ["logo", "http://jaspis.lh.pl/szyle/zdjecia/white_mosaic.jpg"], ["created_at", "2015-02-01 16:34:10.544377"], ["updated_at", "2015-02-01 16:34:10.544377"]]
---
  def create
    @committee = Committee.new(committee_params)
    respond_to do |format|
      if @committee.save

UPDATE "committees" SET "logo" = ?, "updated_at" = ? WHERE "committees"."id" = ?  [["logo", "https://lh4.googleusercontent.com/-sc7MKPDPjfY/AAAAAAAAAAI/AAAAAAAAABA/vocK5PkvbWA/photo.jpg"], ["updated_at", "2015-02-01 19:50:28.161758"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @committee.update(committee_params)

DELETE FROM "committees" WHERE "committees"."id" = ?  [["id", 4]]
---
  def destroy
    @committee.destroy

SELECT  "committees".* FROM "committees" WHERE "committees"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_committee
    @committee = Committee.find(params[:id])