app/controllers/constituencies_controller.rb

SELECT "constituencies".* FROM "constituencies"
---
  def index
    @constituencies = Constituency.all

INSERT INTO "constituencies" ("name", "number_of_voters", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Const1"], ["number_of_voters", 433], ["created_at", "2015-01-24 16:33:52.612959"], ["updated_at", "2015-01-24 16:33:52.612959"]]
---
  def create
    @constituency = Constituency.new(constituency_params)
    respond_to do |format|
      if @constituency.save

UPDATE "constituencies" SET "votes" = ?, "updated_at" = ? WHERE "constituencies"."id" = ?  [["votes", 209], ["updated_at", "2015-02-08 23:01:18.586240"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @constituency.update(constituency_params)

SELECT  "constituencies".* FROM "constituencies" WHERE "constituencies"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_constituency
    @constituency = Constituency.find(params[:id])