app/controllers/useeers_controller.rb

SELECT "useeers".* FROM "useeers"
---
  def index
    @useeers = Useeer.all

INSERT INTO "useeers" ("login", "crypted_password", "persistence_token", "name", "surname", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @useeer = Useeer.new(useeer_params)
    respond_to do |format|
      if @useeer.save

UPDATE "useeers" SET "role" = ?, "updated_at" = ? WHERE "useeers"."id" = ?  [["role", "coordinator2"], ["updated_at", "2015-02-08 21:26:00.963419"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @useeer.update(useeer_params)

SELECT  "useeers".* FROM "useeers" WHERE "useeers"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_useeer
    @useeer = Useeer.find(params[:id])